In [2]:
import datetime as dt
import yfinance as yf
import pandas as pd
import numpy as np
import sqlite3

In [3]:
tickers = pd.read_csv("../pages/data/tickers/oslo_tickers.csv", header=None, names=["ticker"])

tickers

       ticker
0      5PG.OL
1     AASB.OL
2      ABG.OL
3      ABL.OL
4      ADE.OL
..        ...
338    YAR.OL
339    ZAL.OL
340    ZAP.OL
341   ZENA.OL
342  ZWIPE.OL

[343 rows x 1 columns]

In [5]:
tickers.loc[len(tickers.index)] = ["OBXD.OL"]
tickers

       ticker
0      5PG.OL
1     AASB.OL
2      ABG.OL
3      ABL.OL
4      ADE.OL
..        ...
339    ZAL.OL
340    ZAP.OL
341   ZENA.OL
342  ZWIPE.OL
343   OBXD.OL

[344 rows x 1 columns]

In [7]:
con = sqlite3.connect("../pages/data/stockanalysis3.db")
tickers.to_sql("tickers", con, if_exists="append")

344

In [8]:
cursor = con.cursor()
cursor.execute("SELECT COUNT(*) FROM tickers")
result = cursor.fetchone()[0]
result

344

In [9]:
con.close()

In [ ]:
prices["log returns"] = np.log(prices["Adj Close"]) - np.log(prices["Adj Close"].shift(1))

In [ ]:
prices["returns"] = prices["Adj Close"].pct_change()